[[tests]]
name = "auth-log — sudo command execution"

[[tests.inputs]]
insert_at = "parse_and_normalize"
type      = "log"

  [tests.inputs.log_fields]
  message = "Apr 14 11:00:00 db01 sudo[5678]:   deploy : TTY=pts/0 ; PWD=/home/deploy ; USER=root ; COMMAND=/usr/bin/apt update"

[[tests.outputs]]
extract_from = "parse_and_normalize"

[[tests.outputs.conditions]]
type   = "vrl"
source = '''
  assert_eq!(.class_uid, 3002)
  assert_eq!(.severity_id, 1)
  assert_eq!(.status, "Success")
  assert_eq!(.activity_name, "Privilege Escalation")
  assert_eq!(.activity_id, 5)
  assert_eq!(.actor.user.name, "deploy")
  assert_eq!(.unmapped.sudo_command, "/usr/bin/apt update")
  assert_eq!(.unmapped.sudo_target_user, "root")
'''
