[[tests]]
name = "auth-log — sudo command execution"

[[tests.inputs]]
insert_at = "authlog_parse_and_normalize"
type      = "log"

  [tests.inputs.log_fields]
  message  = "  deploy : TTY=pts/0 ; PWD=/home/deploy ; USER=root ; COMMAND=/usr/bin/apt update"
  appname  = "sudo"
  hostname = "db01"
  procid   = "5678"

[[tests.outputs]]
extract_from = "authlog_parse_and_normalize"

[[tests.outputs.conditions]]
type   = "vrl"
source = '''
  assert_eq!(.class_uid, 3002)
  assert_eq!(.severity_id, 1)
  assert_eq!(.status, "Success")
  assert_eq!(.activity_name, "Other")
  assert_eq!(.activity_id, 99)
  assert_eq!(.actor.user.name, "deploy")
  assert_eq!(.unmapped.sudo_command, "/usr/bin/apt update")
  assert_eq!(.unmapped.sudo_target_user, "root")
'''
